# Pandas 
- 데이터 조작 및 분석을 위한 라이브러리
- Series Class : 1차원 : index + value / 동일한 데이터타입의 값만 받아드림
- Dataframe Class : 2차원 : 행과 열을 갖는 표 형태, 서로다른 종류의 자료형 저장가능

In [3]:
import pandas as pd

In [2]:
list1 = [9904312, 3448737, 2890451, 266052]
city = ['서울', '부산', '인천', '대구']
population=pd.Series(list1, index=city)
population

서울    9904312
부산    3448737
인천    2890451
대구     266052
dtype: int64

In [3]:
population.values

array([9904312, 3448737, 2890451,  266052], dtype=int64)

In [4]:
population.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
population.dtype

dtype('int64')

In [6]:
population.name = "인구"
population.index.name = "도시"
population

도시
서울    9904312
부산    3448737
인천    2890451
대구     266052
Name: 인구, dtype: int64

In [7]:
population / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    0.266052
Name: 인구, dtype: float64

In [8]:
population[0], population['서울'] #딕셔너리와 차이점, 키값 외 벨류값으로도 산출가능

(9904312, 9904312)

In [9]:
population

도시
서울    9904312
부산    3448737
인천    2890451
대구     266052
Name: 인구, dtype: int64

In [10]:
#여러개 요소 인덱싱
population[[0,3,1]]

도시
서울    9904312
대구     266052
부산    3448737
Name: 인구, dtype: int64

In [11]:
population[['서울', '대구', '부산']]

도시
서울    9904312
대구     266052
부산    3448737
Name: 인구, dtype: int64

In [12]:
bol= population >= 2500000

In [13]:
population[bol] #트루인 애들만 뽑기

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [14]:
bol = population >= 5000000
bol

도시
서울     True
부산    False
인천    False
대구    False
Name: 인구, dtype: bool

In [15]:
population[bol]

도시
서울    9904312
Name: 인구, dtype: int64

In [16]:
bol1 = population >= 2500000
bol2 = population <= 5000000

In [17]:
bol1 & bol2 #pandas 의 and 산출 & / r , or -> |

도시
서울    False
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [18]:
population[bol1 & bol2]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [19]:
#Series 슬라이싱
population[1:3] # 순서번호 : 시작순서번호 : 끝순서번호 (+1)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [20]:
population['부산':'대구'] # 순서번호 : 시작순서 : 끝순서

도시
부산    3448737
인천    2890451
대구     266052
Name: 인구, dtype: int64

In [21]:
data = {"아구몬" : 9631482,
       "피요몬" : 3393191,
       "텐타몬" : 1490158,
       "가트몬" : 2632035}
digimon = pd.Series(data)
digimon

아구몬    9631482
피요몬    3393191
텐타몬    1490158
가트몬    2632035
dtype: int64

In [22]:
data2 = {"아구몬":9904312,
        "피요몬":3448737,
        "텐타몬":2466052,
        "니드몬":2890451}
digimon_levelup = pd.Series(data2)
digimon_levelup

아구몬    9904312
피요몬    3448737
텐타몬    2466052
니드몬    2890451
dtype: int64

In [23]:
attack = digimon_levelup - digimon # 같은 인덱스를 가진 value 끼리 연산을 진행
attack

가트몬         NaN
니드몬         NaN
아구몬    272830.0
텐타몬    975894.0
피요몬     55546.0
dtype: float64

In [24]:
# 시리즈.notnull() : 비어있는 값(결측치) = False , 값이 있으면 True
bol = attack.notnull()
attack[bol]

아구몬    272830.0
텐타몬    975894.0
피요몬     55546.0
dtype: float64

In [25]:
# 비어있는 데이터 확인
# 시리즈.isnull()
bol = attack.isnull()
attack[bol]

가트몬   NaN
니드몬   NaN
dtype: float64

In [26]:
rp = (digimon_levelup - digimon)/digimon *100
rp[rp.notnull()]

아구몬     2.832690
텐타몬    65.489297
피요몬     1.636984
dtype: float64

In [27]:
# 시리즈값 수정
rp['아구몬'] = 1.6
rp['파닥몬'] = 5.5
del rp['피요몬']

In [28]:
rp

가트몬          NaN
니드몬          NaN
아구몬     1.600000
텐타몬    65.489297
파닥몬     5.500000
dtype: float64

## DataFrame 사용

In [6]:
data = {"2015" :  [9904312, 3448737, 2890451, 2466052],
       "2010" :  [9631482, 3393191, 2632035, 2431774]}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [7]:
df = pd.DataFrame(data) # pd.DataFrame(data, index = ['서울', '대구', '인천', '대구']) 인덱스생성가능
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [31]:
df.index = ['서울', '대구', '인천', '대구']
df

       2015     2010
서울  9904312  9631482
대구  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [32]:
list1 = [[9904312, 3448737, 2890451, 2466052], [9631482, 3393191, 2632035, 2431774]]
list1

[[9904312, 3448737, 2890451, 2466052], [9631482, 3393191, 2632035, 2431774]]

In [33]:
df2 = pd.DataFrame(list1,index=["2015", "2010"], columns =["서울","부산","인천", "대구"])
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [34]:
# 데이터프레임. T : 전치(행과 열을 뒤집어줌)
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [35]:
df.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [36]:
df.index
#dtype = object -> 거의문자열!

Index(['서울', '대구', '인천', '대구'], dtype='object')

In [8]:
df.columns

Index(['2015', '2010'], dtype='object')

In [9]:
# 데이터프레임[컬럼이름] - > 열 인덱싱
df['2015']

0    9904312
1    3448737
2    2890451
3    2466052
Name: 2015, dtype: int64

In [39]:
df[['2010', '2015']]

       2010     2015
서울  9631482  9904312
대구  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [40]:
df['2005'] = [9762546, 351247, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
대구  3448737  3393191   351247
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [10]:
df[] #기본 인덱싱[] 방법 ->인덱스 : 열 인덱싱
     #기본 인덱싱[] -> 슬라이싱을 : 행 인덱싱

SyntaxError: invalid syntax (<ipython-input-10-26c7fd7abd8a>, line 1)

In [ ]:
# loc[] 인덱서
#실제 인덱스를 사용하여 행을 가지고 올때 사용

In [11]:
df.loc['서울':'대구','2015':'2010']

Empty DataFrame
Columns: [2015, 2010]
Index: []

In [12]:
df.iloc[:,1]

0    9631482
1    3393191
2    2632035
3    2431774
Name: 2010, dtype: int64

In [13]:
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [14]:
df.iloc[1,:]

2015    3448737
2010    3393191
Name: 1, dtype: int64

In [15]:
df >=3400000

    2015   2010
0   True   True
1   True  False
2  False  False
3  False  False

In [16]:
bol=df['2010']>=2500000 
bol

0     True
1     True
2     True
3    False
Name: 2010, dtype: bool

In [19]:
df[bol]>=2500000

   2015  2010
0  True  True
1  True  True
2  True  True

In [18]:
df[bol]\

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035

# CSV 파일 불러오기

In [47]:
# pd.read_csv('')
population_number = pd.read_csv('data/population_number.csv', 
                                encoding='euc-kr',
                               index_col='도시')
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [ ]:
population_number.columns

In [ ]:
#시리즈.value_counts():해당 시리즈 내에 value를 세어줌
population_number['지역'].value_counts()

In [ ]:
# 데이터프레임/시리즈.sort_index 함수 / index 기준 오름차순 정렬
population_number['2010'].sort_index()

In [ ]:
#시리즈.sort_values() / 시리즈 오름차순 정렬
population_number['2010'].sort_values(ascending=False)
#ascending 옵션 : True 일때 오름차순 정렬 / False내림차순

In [ ]:
# population_number.sort_values(정렬기준이 되는 컬럼)
population_number.sort_values('2005',ascending=False)

In [ ]:
#여러개의 컬럼값을 기준으로 정렬
population_number.sort_values(by = ['지역','2010'])

In [48]:
score  =  pd.read_csv('data/score.csv', encoding="euc-kr" , index_col = '과목')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [ ]:
score.sum()

In [ ]:
score.sum().sort_values(ascending=False)

In [ ]:
score.sum(axis = 0)
#axis 옵션 기본 0 (행), 연산을 진행할 방향 (0 행 / 1 열)

In [49]:
score['합계'] = score.loc[:,'1반':'4반'].sum(axis=1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [52]:
score['평균'] = score.loc[:,:'4반'].mean(axis=1)
score

       1반    2반    3반    4반     합계     평균
과목
파이썬  45.0  44.0  73.0  39.0  201.0  50.25
DB   76.0  92.0  45.0  69.0  282.0  70.50
자바   47.0  92.0  45.0  69.0  253.0  63.25
크롤링  92.0  81.0  85.0  40.0  298.0  74.50
Web  11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [56]:
#새로운 행 / 열 만드는 방법
# ->만들고 싶은 행.열을 인덱싱 후 대입연산자를 통해 값을 넣어주자
score.loc['반평균',:] = score.loc['파이썬':'Web',:].mean()
score

       1반    2반    3반    4반     합계     평균
과목
파이썬  45.0  44.0  73.0  39.0  201.0  50.25
DB   76.0  92.0  45.0  69.0  282.0  70.50
자바   47.0  92.0  45.0  69.0  253.0  63.25
크롤링  92.0  81.0  85.0  40.0  298.0  74.50
Web  11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [57]:
#행/ 열 삭제하는 방법
#score에 다시 넣어야함, 바로반영을안하기때문에
#score = score.drop('삭제 index(행)항목' or 컬럼(열), axix=0(행, index) or 1(열, colomn), axix=0 or 1) 
#score.drop('삭제 index(행)항목' or 컬럼(열), axix=0(행, index) or 1(열, colomn), inplace=True)  도 대체가능

In [58]:
score.max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [60]:
score.min(1)

과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
반평균    48.6
dtype: float64

In [66]:
#전체반에서 과목별 가장 높은점수
maxarr=score.loc['파이썬':'Web','1반':'4반'].max(axis=1)

In [67]:
#전체반에서 과목별 가장 낮은점수
minarr=score.loc['파이썬':'Web','1반':'4반'].min(axis=1)

In [70]:
maxarr - minarr

과목
파이썬    34.0
DB     47.0
자바     47.0
크롤링    52.0
Web    68.0
dtype: float64

In [78]:
#판다스 함수 적용하기 apply(함수이름, axis=?)
def max_min(s):
    dif = s.max() - s.min()
    return dif

In [77]:
#판다스 함수 적용하기 apply(함수이름, axis=?)
score.loc[:'Web',:'4반'].apply(max_min, axis=1)

과목
파이썬    34.0
DB     47.0
자바     47.0
크롤링    52.0
Web    68.0
dtype: float64

In [87]:
# fillna(원하는값)
#결측치 (NaN) 을 원하는 값으로 바꾸는 함수
# population_number=population_number.fillna(0)
population_number.fillna(0, inplace=True)

In [88]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        0.0        0.0  3655437
인천  수도권  2890451  2632035.0        0.0  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [93]:
#카테고리 만들기
#pd.cut(카테고리화를 진행할 데이터, 
#      카테고리화를 진행할 범위, 
#      labels = 각 카테고리별 이름, 
#      right=기본적으로 True 2번째 매개변수로 설정해준 범위 중 오른쪽을 범위값으로 포함, 왼쪽은 포함하지 않음 x<값<=y)
ages = [0,2,10,21,23,37,31,61,20,41,32,100]

bins = [0,15,25,35,60,99]

label = ['미성년자','청년', '중년' ,'장년','노년']

cuts=pd.cut(ages, bins, labels=label, right=False)
cuts

['미성년자', '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [95]:
type(cuts)

pandas.core.arrays.categorical.Categorical

In [100]:
agedf=pd.DataFrame(ages, columns =['ages'])
agedf

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [104]:
agedf['age_cut'] = cuts
agedf
agedf['age_cut'].value_counts()

청년      3
미성년자    3
장년      2
중년      2
노년      1
Name: age_cut, dtype: int64

In [105]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [108]:
display(df1)
display(df2)
display(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [112]:
# concat 함수 (데이터베이스 합치기)
result=pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [113]:
# concat 함수 (데이터베이스 합치기)
result=pd.concat([df1,df2,df3], keys=['x','y','z'])
# concat 시 keys를 부여하면 다중 index가 된다.
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [114]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [116]:
#멀티 인덱싱에 대해 접근하기위해선 튜플로 멀티인덱스를 묶는다
result.loc[('y',5)]

A    A5
B    B5
C    C5
D    D5
Name: (y, 5), dtype: object

In [119]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [121]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [127]:
result = pd.concat([df1,df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [129]:
result = pd.concat([df1,df4], axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [130]:
pd.concat([df1, df4])

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [132]:
#기존 인덱스 무시하고 새로운 인덱스부여( 0~)
pd.concat([df1, df4], ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [ ]:
# concat() 인덱스/ 컬럼에 영향을 받아 dataframe 병합

In [ ]:
# merge() 값을 기준으로 병합

In [134]:
df5 = pd.DataFrame({'key' : ['K0','K2','K3','K4'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})

df6 = pd.DataFrame({'key' : ['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [135]:
pd.merge(df5, df6, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A1  B1  C2  D2
2  K3  A2  B2  C3  D3

In [136]:
pd.merge(df5, df6, on='key', how='outer')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K2   A1   B1   C2   D2
2  K3   A2   B2   C3   D3
3  K4   A3   B3  NaN  NaN
4  K1  NaN  NaN   C1   D1

In [137]:
# concat, merge(): 따로 관리되는 여러 데이터 프레임을 하나의 데이터프레임으로 만들어 줄 수 있다.

## 최종실습

In [3]:
df2015 = pd.read_csv("data/2015.csv", encoding='euc-kr' , index_col='관서명')
df2016 =pd.read_csv("data/2016.csv", encoding='euc-kr',index_col='관서명')
df2017=pd.read_csv("data/2017.csv", encoding='euc-kr',index_col='관서명')

In [4]:
#데이터프레임.head(n) 해당 데이터프레임 의 위의 n개의 행만 표기 / 생략한다면 n=5
display(df2015.head())
display(df2016.head())
display(df2017.head())

            구분  살인  강도  강간·강제추행    절도     폭력
관서명
광주지방경찰청계  발생건수  18  44      750  8425   9593
광주지방경찰청계  검거건수  18  47      758  5409   8301
광주지방경찰청계  검거인원  17  66      776  3433  11774
광주지방경찰청계    구속   9  33       42   104     58
광주지방경찰청계   불구속   1  26      511  2781   5618

            구분  살인  강도  강간·강제추행    절도     폭력
관서명
광주지방경찰청계  발생건수  17  47      701  6052   8599
광주지방경찰청계  검거건수  18  47      713  4242   7631
광주지방경찰청계  검거인원  21  54      758  3455  10747
광주지방경찰청계    구속  14  25       37   132     57
광주지방경찰청계   불구속   3  25      491  2862   5267

            구분  살인  강도  강간·강제추행    절도     폭력
관서명
광주지방경찰청계  발생건수   9  33      725  4816   8366
광주지방경찰청계  검거건수   9  32      732  3487   7553
광주지방경찰청계  검거인원  10  61      824  3046  11018
광주지방경찰청계    구속   8  28       71   115     88
광주지방경찰청계   불구속   0  26      523  2493   5235

In [156]:
# 데이터프레임.info()
df2015.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36 entries, 광주지방경찰청계 to 광주광산경찰서
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   구분       36 non-null     object
 1   살인       36 non-null     int64
 2   강도       36 non-null     int64
 3   강간·강제추행  36 non-null     int64
 4   절도       36 non-null     int64
 5   폭력       36 non-null     int64
dtypes: int64(5), object(1)
memory usage: 2.0+ KB

In [157]:
df2016.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36 entries, 광주지방경찰청계 to 광주광산경찰서
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   구분       36 non-null     object
 1   살인       36 non-null     int64
 2   강도       36 non-null     int64
 3   강간·강제추행  36 non-null     int64
 4   절도       36 non-null     int64
 5   폭력       36 non-null     int64
dtypes: int64(5), object(1)
memory usage: 2.0+ KB

In [158]:
df2017.info()

<class 'pandas.core.frame.DataFrame'>
Index: 42 entries, 광주지방경찰청계 to 광주광산경찰서
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   구분       42 non-null     object
 1   살인       42 non-null     int64
 2   강도       42 non-null     int64
 3   강간·강제추행  42 non-null     int64
 4   절도       42 non-null     int64
 5   폭력       42 non-null     int64
dtypes: int64(5), object(1)
memory usage: 2.3+ KB

In [187]:
print(df2015.index.unique())
print(df2017.index.unique())

Index(['광주지방경찰청계', '광주동부경찰서', '광주서부경찰서', '광주남부경찰서', '광주북부경찰서', '광주광산경찰서'], dtype='object', name='관서명')
Index(['광주지방경찰청계', '광주동부경찰서', '광주서부경찰서', '광주남부경찰서', '광주북부경찰서', '광주광산경찰서'], dtype='object', name='관서명')

In [5]:
# 2017년도에만 있는 인덱스 '광주지방경찰청' 삭제
# 데이터프레임.drop() 은 본래 데이터프레임이 수정되지 않는다.
df2017 = df2017.drop('광주지방경찰청' , axis=0)

In [186]:
df2017

            구분  살인  강도  강간·강제추행    절도     폭력     총계
관서명
광주지방경찰청계  발생건수   9  33      725  4816   8366  13949
광주지방경찰청계  검거건수   9  32      732  3487   7553  11813
광주지방경찰청계  검거인원  10  61      824  3046  11018  14959
광주지방경찰청계    구속   8  28       71   115     88    310
광주지방경찰청계   불구속   0  26      523  2493   5235   8277
광주지방경찰청계    기타   2   7      230   438   5695   6372
광주동부경찰서   발생건수   3   5       77   624   1090   1799
광주동부경찰서   검거건수   3   5       70   470    953   1501
광주동부경찰서   검거인원   4   4       76   483   1538   2105
광주동부경찰서     구속   2   3        2    19      9     35
광주동부경찰서    불구속   0   1       57   395    801   1254
광주동부경찰서     기타   2   0       17    69    728    816
광주서부경찰서   발생건수   0   7      196  1142   2293   3638
광주서부경찰서   검거건수   0   7      172   708   2065   2952
광주서부경찰서   검거인원   0  23      188   708   2971   3890
광주서부경찰서     구속   0   8        6    20     31     65
광주서부경찰서    불구속   0  15      123   582   1356   2076
광주서부경찰서     기타   0   0       59   106   1584   1749
광주남부경찰서   발생건수   0   4       68   577    898   1547
광주남부경찰서   검거건수   0   4       51   522    799   1376
광주남부경찰서   검거인원   0   5       47   363   1107   1522
광주남부경찰서     구속   0   2        1    18      1     22
광주남부경찰서    불구속   0   2       29   271    591    893
광주남부경찰서     기타   0   1       17    74    515    607
광주북부경찰서   발생건수   3   5      215  1546   2176   3945
광주북부경찰서   검거건수   3   5      204  1127   1997   3336
광주북부경찰서   검거인원   3   6      260   898   2863   4030
광주북부경찰서     구속   3   4       39    33     22    101
광주북부경찰서    불구속   0   0      159   730   1314   2203
광주북부경찰서     기타   0   2       62   135   1527   1726
광주광산경찰서   발생건수   3  12      169   927   1909   3020
광주광산경찰서   검거건수   3  10      144   660   1702   2519
광주광산경찰서   검거인원   3  22      148   594   2390   3157
광주광산경찰서     구속   3  11        6    25     18     63
광주광산경찰서    불구속   0   7      102   515   1104   1728
광주광산경찰서     기타   0   4       40    54   1268   1366

In [6]:
df2015['총계'] = df2015.loc[:,'살인':'폭력'].sum(axis=1)
df2015

            구분  살인  강도  강간·강제추행    절도     폭력     총계
관서명
광주지방경찰청계  발생건수  18  44      750  8425   9593  18830
광주지방경찰청계  검거건수  18  47      758  5409   8301  14533
광주지방경찰청계  검거인원  17  66      776  3433  11774  16066
광주지방경찰청계    구속   9  33       42   104     58    246
광주지방경찰청계   불구속   1  26      511  2781   5618   8937
광주지방경찰청계    기타   7   7      223   548   6098   6883
광주동부경찰서   발생건수   3   5       92  1100   1155   2355
광주동부경찰서   검거건수   4   6       86   583    970   1649
광주동부경찰서   검거인원   4   7       98   447   1483   2039
광주동부경찰서     구속   3   2        8    13     10     36
광주동부경찰서    불구속   0   4       63   379    703   1149
광주동부경찰서     기타   1   1       27    55    770    854
광주서부경찰서   발생건수   5  10      172  2050   2483   4720
광주서부경찰서   검거건수   4   8      153  1471   2124   3760
광주서부경찰서   검거인원   4  15      167   876   3080   4142
광주서부경찰서     구속   3  10        7    27     19     66
광주서부경찰서    불구속   0   5       91   665   1366   2127
광주서부경찰서     기타   1   0       69   184   1695   1949
광주남부경찰서   발생건수   1   3       70   962   1081   2117
광주남부경찰서   검거건수   1   3       53   506    941   1504
광주남부경찰서   검거인원   1   3       52   418   1260   1734
광주남부경찰서     구속   0   3        3    19      3     28
광주남부경찰서    불구속   1   0       39   325    675   1040
광주남부경찰서     기타   0   0       10    74    582    666
광주북부경찰서   발생건수   5  14      256  2570   2621   5466
광주북부경찰서   검거건수   5  18      212  1852   2319   4406
광주북부경찰서   검거인원   5  28      216   948   3168   4365
광주북부경찰서     구속   3  11       11    30     10     65
광주북부경찰서    불구속   0  12      153   770   1544   2479
광주북부경찰서     기타   2   5       52   148   1614   1821
광주광산경찰서   발생건수   4  12      160  1743   2253   4172
광주광산경찰서   검거건수   4  10      135   996   1922   3067
광주광산경찰서   검거인원   3   8      129   736   2585   3461
광주광산경찰서     구속   0   4        5    12      6     27
광주광산경찰서    불구속   0   4       81   639   1181   1905
광주광산경찰서     기타   3   0       43    85   1398   1529

In [7]:
df2016['총계'] = df2016.loc[:,'살인':'폭력'].sum(axis=1)

In [8]:
df2017['총계'] = df2017.loc[:,'살인':'폭력'].sum(axis=1)

In [9]:
s1 = df2015[df2015['구분']=='발생건수'].loc[:,'총계']
s1.name ='2015 총계'
s1

관서명
광주지방경찰청계    18830
광주동부경찰서      2355
광주서부경찰서      4720
광주남부경찰서      2117
광주북부경찰서      5466
광주광산경찰서      4172
Name: 2015 총계, dtype: int64

In [20]:
s2 = df2016[df2016['구분']=='발생건수'].loc[:,'총계']
s2.name = '2016 총계'
s2

관서명
광주지방경찰청계    15416
광주동부경찰서      2068
광주서부경찰서      3892
광주남부경찰서      1865
광주북부경찰서      4148
광주광산경찰서      3443
Name: 2016 총계, dtype: int64

In [21]:
s3 = df2017[df2017['구분']=='발생건수'].loc[:,'총계']
s3.name = '2017 총계'
s3

관서명
광주지방경찰청계    13949
광주동부경찰서      1799
광주서부경찰서      3638
광주남부경찰서      1547
광주북부경찰서      3945
광주광산경찰서      3020
Name: 2017 총계, dtype: int64

In [33]:
#2015 ~ 2016년 증감률
s4 = (s2-s1)/s1*100
s4.name = '2015-2016증감율'
s4

관서명
광주지방경찰청계   -18.130643
광주동부경찰서    -12.186837
광주서부경찰서    -17.542373
광주남부경찰서    -11.903637
광주북부경찰서    -24.112697
광주광산경찰서    -17.473634
Name: 2015-2016증감율, dtype: float64

In [34]:
#2016 ~ 2017년 증감률
s5 = (s3-s2)/s2*100
s5.name = '2016-2017증감율'
s5

관서명
광주지방경찰청계    -9.516087
광주동부경찰서    -13.007737
광주서부경찰서     -6.526208
광주남부경찰서    -17.050938
광주북부경찰서     -4.893925
광주광산경찰서    -12.285797
Name: 2016-2017증감율, dtype: float64

In [36]:
pdc = pd.concat([s1,s4,s2,s5,s3],axis=1)
pdc

          2015 총계  2015-2016증감율  2016 총계  2016-2017증감율  2017 총계
관서명
광주지방경찰청계    18830    -18.130643    15416     -9.516087    13949
광주동부경찰서      2355    -12.186837     2068    -13.007737     1799
광주서부경찰서      4720    -17.542373     3892     -6.526208     3638
광주남부경찰서      2117    -11.903637     1865    -17.050938     1547
광주북부경찰서      5466    -24.112697     4148     -4.893925     3945
광주광산경찰서      4172    -17.473634     3443    -12.285797     3020